# ElementId Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementId Constructor
ElementId Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ElementId(Int32) | **Obsolete.** Create an ElementId handle with the given 32-bit integer id. |
| ElementId(Int64) | Create an ElementId handle with the given 64-bit integer id. |
| ElementId(BuiltInCategory) | Create an ElementId handle with the given BuiltInCategory id. |
| ElementId(BuiltInParameter) | Create an ElementId handle with the given BuiltInParameter id. |

# See Also
ElementId Class
ElementId Members
Autodesk.Revit.DB Namespace